Repository: JUNERDD/Atd
Catalog: apps/macos/App/Localizable.xcstrings
Source language: en
Languages: zh_hans

# app.pick.title
source: Choose apps where the selection toolbar stays hidden
zh_hans: 选择不显示选择文字工具栏的 App

# artifact.open.message
source: This file type can run code on your Mac. Open it only if you trust where it came from.
zh_hans: 这种文件可以在你的 Mac 上运行代码。只有在你信任它的来源时才打开。

# artifact.open.openAnyway
source: Open Anyway
zh_hans: 仍要打开

# artifact.open.showInFinder
source: Show in Finder
zh_hans: 在访达中显示

# artifact.open.title
source: Open “%@”?
zh_hans: 打开“%@”吗？

# automation.notice.attention.body
source: Some actions or questions were declined because no one was there.
zh_hans: 由于无人在场，部分操作或提问已被拒绝。

# automation.notice.attention.declined.one
source: 1 action or question was declined because no one was there.
zh_hans: 由于无人在场，已拒绝 1 项操作或提问。

# automation.notice.attention.declined.other
source: %lld actions or questions were declined because no one was there.
zh_hans: 由于无人在场，已拒绝 %lld 项操作或提问。

# automation.notice.attention.title
source: “%@” needs your attention
zh_hans: “%@”需要你处理

# automation.notice.delivered.body
source: Finished — open to see the result.
zh_hans: 已完成，打开即可查看结果。

# automation.notice.failed.body
source: Something went wrong before it could finish.
zh_hans: 运行在完成前出了问题。

# automation.notice.failed.title
source: “%@” didn’t finish
zh_hans: “%@”未能完成

# automation.notice.paused.body
source: It failed several times in a row. You can turn it back on in Settings › Automations.
zh_hans: 它连续多次运行失败。你可以在“设置 › 自动化”中重新开启。

# automation.notice.paused.title
source: “%@” was turned off
zh_hans: “%@”已关闭

# capture.color.black
source: Black
zh_hans: 黑色

# capture.color.blue
source: Blue
zh_hans: 蓝色

# capture.color.green
source: Green
zh_hans: 绿色

# capture.color.red
source: Red
zh_hans: 红色

# capture.color.white
source: White
zh_hans: 白色

# capture.color.yellow
source: Yellow
zh_hans: 黄色

# capture.confirm
source: Done
zh_hans: 完成

# capture.copy
source: Copy
zh_hans: 复制

# capture.hint.accessibility
source: Allow Accessibility to detect interface elements
zh_hans: 允许辅助功能以识别界面元素

# capture.hint.idle
source: Click a highlighted area or drag to select · Scroll for a larger area · ⌘A for the whole screen · Esc to cancel
zh_hans: 点击高亮区域或拖动选择 · 滚动切换更大区域 · ⌘A 选择整个屏幕 · Esc 取消

# capture.hint.recall
source: R to reuse the last area
zh_hans: R 复用上次区域

# capture.hint.selected
source: Drag the edges to resize · Return to confirm · Esc to go back
zh_hans: 拖动边缘调整大小 · 回车确认 · Esc 返回

# capture.hint.windowsOnly
source: Windows only · W to detect elements again
zh_hans: 仅识别窗口 · 按 W 恢复识别元素

# capture.redaction.blur
source: Blur
zh_hans: 模糊

# capture.redaction.pixelate
source: Mosaic
zh_hans: 马赛克

# capture.redaction.solid
source: Cover
zh_hans: 遮盖

# capture.redo
source: Redo
zh_hans: 重做

# capture.size
source: Size
zh_hans: 大小

# capture.size.tooltip
source: Size — scroll anywhere, or press - and =
zh_hans: 大小：在任意位置滚动滚轮，或按 - 和 =

# capture.styleBar
source: Annotation Style
zh_hans: 标注样式

# capture.textBackground
source: Text background
zh_hans: 文字背景

# capture.tool.arrow
source: Arrow
zh_hans: 箭头

# capture.tool.ellipse
source: Ellipse
zh_hans: 椭圆

# capture.tool.highlighter
source: Highlighter
zh_hans: 荧光笔

# capture.tool.line
source: Line
zh_hans: 直线

# capture.tool.mosaic
source: Mosaic
zh_hans: 马赛克

# capture.tool.pen
source: Pen
zh_hans: 画笔

# capture.tool.rectangle
source: Rectangle
zh_hans: 矩形

# capture.tool.select
source: Select
zh_hans: 选择

# capture.tool.spotlight
source: Spotlight
zh_hans: 聚光灯

# capture.tool.step
source: Step Number
zh_hans: 序号

# capture.tool.text
source: Text
zh_hans: 文字

# capture.toolbar
source: Annotation Tools
zh_hans: 标注工具

# capture.toolbar.move
source: Drag to move · Double-click to put back
zh_hans: 拖动以移动 · 双击放回原位

# capture.undo
source: Undo
zh_hans: 撤销

# common.cancel
source: Cancel
zh_hans: 取消

# error.developmentLogs
source: In development the agent service logs to the terminal that runs pnpm dev.
zh_hans: 开发版中的代理服务日志输出在运行 pnpm dev 的终端里。

# error.developmentRestart
source: In development the agent service runs from pnpm dev. Restart it there.
zh_hans: 开发版中的代理服务由 pnpm dev 运行，请在那里重新启动。

# error.restartService.message
source: The agent service could not be restarted.
zh_hans: 代理服务未能重新启动。

# error.restartService.title
source: Could not restart the agent service
zh_hans: 无法重启代理服务

# error.showLogs.message
source: The log folder could not be opened.
zh_hans: 无法打开日志文件夹。

# error.showLogs.title
source: Could not show the service logs
zh_hans: 无法显示服务日志

# file.pick.title
source: Attach text files
zh_hans: 附加文本文件

# file.save.failed
source: The file could not be saved.
zh_hans: 无法保存文件。

# file.save.invalidImage
source: The image could not be saved because it is not a valid PNG.
zh_hans: 无法保存该图片：它不是有效的 PNG。

# file.save.title
source: Save file
zh_hans: 保存文件

# folder.pick.title
source: Choose folders to add
zh_hans: 选择要添加的文件夹

# mcpApproval.allow
source: Allow to Run
zh_hans: 允许运行

# mcpApproval.environment.inherited
source: Inherits the service environment
zh_hans: 继承服务端的环境

# mcpApproval.environment.only
source: Only the variables below
zh_hans: 仅下面列出的变量

# mcpApproval.field.arguments
source: Arguments:
zh_hans: 参数：

# mcpApproval.field.command
source: Command:
zh_hans: 命令：

# mcpApproval.field.environment
source: Environment:
zh_hans: 环境变量：

# mcpApproval.field.headers
source: Headers:
zh_hans: 请求头：

# mcpApproval.field.plugin
source: Plugin:
zh_hans: 插件：

# mcpApproval.field.resolvedCommand
source: Runs:
zh_hans: 实际运行：

# mcpApproval.field.revision
source: Revision:
zh_hans: 修订版本：

# mcpApproval.field.sentEnv
source: Service env vars sent:
zh_hans: 会发送的服务端环境变量：

# mcpApproval.field.server
source: Server:
zh_hans: 服务器：

# mcpApproval.field.source
source: Source:
zh_hans: 来源：

# mcpApproval.field.tokenEnv
source: Bearer token from:
zh_hans: Bearer 令牌来自：

# mcpApproval.field.type
source: Type:
zh_hans: 类型：

# mcpApproval.field.workingDirectory
source: Working directory:
zh_hans: 工作目录：

# mcpApproval.flag.readsEnv
source: Reads service env vars
zh_hans: 读取服务端环境变量

# mcpApproval.flag.risky
source: Changes what runs
zh_hans: 会改变实际运行的内容

# mcpApproval.hiddenValue
source: (hidden, %lld characters)
zh_hans: （已隐藏，%lld 个字符）

# mcpApproval.layer.plugin
source: Plugin server
zh_hans: 插件服务器

# mcpApproval.layer.user
source: User server
zh_hans: 用户服务器

# mcpApproval.message.changed
source: It changed since you last allowed it.
zh_hans: 它在你上次允许之后发生了变化。

# mcpApproval.message.http
source: This MCP server sends the service values below to %@. Allow it only if you trust that address.
zh_hans: 这个 MCP 会把下面的服务端值发送到 %@。只有在你信任这个地址时才允许。

# mcpApproval.message.plugin
source: The plugin “%1$@” (%2$@) wants to run the command below with your permissions. Allow it only if you trust where the plugin came from.
zh_hans: 插件“%1$@”（%2$@）要以你的权限运行下面的命令。只有在你信任这个插件的来源时才允许。

# mcpApproval.message.user
source: This local MCP server runs the command below with your permissions. Allow it only if you added it and trust it.
zh_hans: 这个本地 MCP 会以你的权限运行下面的命令。只有在你自己添加并信任它时才允许。

# mcpApproval.none
source: None
zh_hans: 无

# mcpApproval.title
source: Allow “%@” to run on this Mac?
zh_hans: 允许“%@”在这台 Mac 上运行吗？

# menu.checkForUpdates
source: Check for Updates…
zh_hans: 检查更新…

# menu.developmentHint
source: Agent service not running — run pnpm dev
zh_hans: 代理服务未运行，请运行 pnpm dev

# menu.edit
source: Edit
zh_hans: 编辑

# menu.edit.copy
source: Copy
zh_hans: 拷贝

# menu.edit.cut
source: Cut
zh_hans: 剪切

# menu.edit.delete
source: Delete
zh_hans: 删除

# menu.edit.paste
source: Paste
zh_hans: 粘贴

# menu.edit.pasteAndMatchStyle
source: Paste and Match Style
zh_hans: 粘贴并匹配样式

# menu.edit.redo
source: Redo
zh_hans: 重做

# menu.edit.selectAll
source: Select All
zh_hans: 全选

# menu.edit.showSubstitutions
source: Show Substitutions
zh_hans: 显示替换

# menu.edit.smartDashes
source: Smart Dashes
zh_hans: 智能破折号

# menu.edit.smartQuotes
source: Smart Quotes
zh_hans: 智能引号

# menu.edit.speech
source: Speech
zh_hans: 语音

# menu.edit.startSpeaking
source: Start Speaking
zh_hans: 开始朗读

# menu.edit.stopSpeaking
source: Stop Speaking
zh_hans: 停止朗读

# menu.edit.substitutions
source: Substitutions
zh_hans: 替换

# menu.edit.textReplacement
source: Text Replacement
zh_hans: 文本替换

# menu.edit.undo
source: Undo
zh_hans: 撤销

# menu.hidePanel
source: Hide task panel
zh_hans: 隐藏任务面板

# menu.onboarding
source: Welcome Guide…
zh_hans: 欢迎指南…

# menu.quit
source: Quit Atd
zh_hans: 退出 Atd

# menu.restartService
source: Restart Agent Service
zh_hans: 重启代理服务

# menu.selectionListening
source: Show Toolbar for Selections
zh_hans: 选中文字时显示工具栏

# menu.settings
source: Settings…
zh_hans: 设置…

# menu.showMiniPanel
source: Show Mini Panel
zh_hans: 显示迷你面板

# menu.showPanel
source: Show task panel
zh_hans: 显示任务面板

# menu.showServiceLogs
source: Show Service Logs
zh_hans: 显示服务日志

# menu.view
source: View
zh_hans: 显示

# menu.view.reload
source: Reload Page
zh_hans: 重新载入页面

# miniPanel.ask
source: Ask about the selected text
zh_hans: 就所选文字询问 Atd

# miniPanel.commands
source: Commands
zh_hans: 命令

# miniPanel.drop
source: Drop to add as context
zh_hans: 松开以添加为上下文

# miniPanel.hide
source: Hide Mini Panel
zh_hans: 隐藏迷你面板

# miniPanel.hidePanel
source: Hide Atd
zh_hans: 隐藏 Atd

# miniPanel.label
source: Atd Mini Panel
zh_hans: Atd 迷你面板

# miniPanel.moveLeft
source: Move to Left Edge
zh_hans: 移到左侧边缘

# miniPanel.moveRight
source: Move to Right Edge
zh_hans: 移到右侧边缘

# miniPanel.newTask
source: New task
zh_hans: 新建任务

# miniPanel.open
source: Open Atd
zh_hans: 打开 Atd

# miniPanel.openOnClick
source: Open on Click
zh_hans: 点击时打开

# miniPanel.screenshot
source: Take a screenshot
zh_hans: 截图

# pin.failed
source: The app could not be pinned to the desktop.
zh_hans: 无法将这个应用固定到桌面。

# pin.limit
source: You can pin up to %lld apps to the desktop.
zh_hans: 最多可将 %lld 个应用固定到桌面。

# pin.menu.appIcon
source: App Icon
zh_hans: 应用图标

# pin.menu.open
source: Open “%@”
zh_hans: 打开“%@”

# pin.menu.remove
source: Remove from Desktop
zh_hans: 从桌面移除

# pin.menu.widget
source: Widget
zh_hans: 小组件

# pin.size.large
source: Large
zh_hans: 大

# pin.size.medium
source: Medium
zh_hans: 中

# pin.size.small
source: Small
zh_hans: 小

# pin.unreadable
source: This widget can’t be shown.
zh_hans: 无法显示这个小组件。

# quit.confirm
source: Quit
zh_hans: 退出

# quit.detail
source: Quitting stops them. Queued tasks stay queued and start the next time Atd opens.
zh_hans: 退出会停止这些任务。排队中的任务会保留，下次打开 Atd 时开始运行。

# quit.message.one
source: 1 task is still running.
zh_hans: 还有 1 个任务正在运行。

# quit.message.other
source: %lld tasks are still running.
zh_hans: 还有 %lld 个任务正在运行。

# quit.title
source: Quit Atd?
zh_hans: 要退出 Atd 吗？

# selectionHud.hide
source: Hide until next time
zh_hans: 隐藏到下次开启

# selectionHud.hint
source: Press %@ twice to turn off
zh_hans: 连按两次 %@ 关闭

# selectionHud.off
source: Selection toolbar off
zh_hans: 选区工具栏已关闭

# selectionHud.on
source: Selection toolbar on
zh_hans: 选区工具栏已开启

source: Selection toolbar
zh_hans: 选择文字工具栏

# selectionToolbar.ask
source: Ask Atd
zh_hans: 问 Atd

# selectionToolbar.ask.tooltip
source: Ask Atd about the selected text
zh_hans: 就所选文字询问 Atd

# selectionToolbar.more
source: More
zh_hans: 更多

# selectionToolbar.more.tooltip
source: More commands
zh_hans: 更多命令

# status.attention
source: %lld waiting for you
zh_hans: %lld 个等待处理

# status.developmentHint
source: Run pnpm dev to start the agent service
zh_hans: 请运行 pnpm dev 启动代理服务

# status.running
source: %lld running
zh_hans: %lld 个运行中

# status.unavailable
source: Service unavailable
zh_hans: 服务不可用

# userApp.clear.failed
source: The app's data could not be cleared. It will be removed the next time Atd starts.
zh_hans: 无法清除这个应用的数据。Atd 下次启动时会再次删除。

# userApp.files.pick.title
source: Choose files for “%@”
zh_hans: 为“%@”选择文件

# userApp.files.tooLarge
source: A chosen file is larger than 8 MB or cannot be read.
zh_hans: 所选文件超过 8 MB 或无法读取。

# userApp.link.message
source: “%1$@” wants to open %2$@ in your browser.
zh_hans: “%1$@”想在浏览器中打开 %2$@。

# userApp.link.open
source: Open Link
zh_hans: 打开链接

# userApp.link.title
source: Open this link?
zh_hans: 打开这个链接吗？

# userApp.open.failed
source: The app could not be opened.
zh_hans: 无法打开这个应用。

# userApp.open.missing
source: This app no longer exists.
zh_hans: 这个应用已不存在。

# window.onboarding.title
source: Welcome to Atd
zh_hans: 欢迎使用 Atd

# window.settings.title
source: Atd Settings
zh_hans: Atd 设置
